[
    "Boil half a kettle. Peel and finely dice the red onion. Peel (scrape the skin off with a teaspoon) and grate (or finely chop) the ginger. Peel and grate (or finely chop) the garlic. Cut the red chilli in half lengthways, deseed (scrape the seeds out with a teaspoon) and chop finely.",
    "Heat a large, wide-based pan (preferably non-stick, with a matching lid) with a drizzle of vegetable oil over a medium heat. Once hot, add the diced red onion and cook for 3-4 min or until starting to soften. Once softened, add the grated ginger and grated garlic to the pan and cook for 1 min or until fragrant.",
    "Add the basmati rice, a pinch of salt and 300ml cold water to a pot with a lid and bring to the boil over a high heat. Once boiling, reduce the heat to very low and cook, covered, for 12-15 min or until all the water has absorbed and the rice is cooked. Once cooked, remove from the heat and keep covered until serving.",
    "While the rice is cooking, chop the creamed coconut roughly (if required!). Dissolve the chopped creamed coconut and vegetable stock mix in 300ml boiled water - this is your coconut stock.",
    "Add the curry powder and ground turmeric to the onion and cook for 30 secs or until fragrant. Add the tomato paste, most of the chopped chilli and 1 tsp sugar and cook for a further 1 min. Add the coconut stock and cook for 1-2 min or until starting to reduce - this is your Goan-style curry sauce.",
    "Wash the spinach, then chop it roughly. Add the chopped spinach to the curry and stir continuously for 1-2 min or until wilted.",
    "While the spinach wilts, cut the basa fillets into bite-sized pieces. Place the chopped basa over the curry and cook, covered, for 6-7 min or until cooked through - this is your Goan-style basa & spinach curry. Tip: Your fish is cooked when it turns opaque and flakes easily. Chop the coriander including the stalks, then stir it through the cooked rice - this is your coriander rice.",
    "Serve the Goan-style basa & spinach curry over the coriander rice and garnish with the remaining chopped chilli (not a fan of spice? Just add a little!). Tip: For fancy presentation, press the rice into small bowls and turn out. Enjoy!"
  ]