[
    "Preheat the oven to 240°C/ 220°C (fan)/ gas 9. Boil a kettle. Chop the leek in half lengthways, then wash thoroughly to remove any grit from between the leaves. Top, tail and slice finely. Peel and finely chop (or grate) the garlic.",
    "Add the tortiglioni to a pot of boiled water with a pinch of salt, bring to the boil over a high heat and cook for 7-10 min or until cooked with a slight bite. Tip: It doesn't need to be fully cooked, as it will go in the oven later! Once done, drain the cooked tortiglioni and set it aside for later. Reboil half a kettle.",
    "While the pasta is cooking, heat a large, wide-based pan (preferably non-stick) with a drizzle of olive oil and a knob of butter over a medium-high heat. Once hot, add the chopped leek and chopped garlic with a pinch of salt and cook for 4-5 min or until beginning to soften.",
    "Meanwhile, dissolve the vegetable stock mix and most of the goats' cheese (you'll use the rest later!) in 200ml boiled water - this is your cheesy stock. Cut the cherry tomatoes in half.",
    "Once the leeks have slightly softened, add the dried oregano and halved cherry tomatoes to the pan and cook for 1-2 min. Meanwhile, chop the basil finely, including the stalks. Wash the spinach, then pat it dry with kitchen paper.",
    "Add 1 tbsp flour to the pan and give everything a good mix up. Add the cheesy stock with the spinach and season with a generous grind of black pepper. Cook for 1-2 min, stirring frequently, or until the sauce has thickened slightly.",
    "Add the drained tortiglioni to the sauce with the chopped basil (save some for garnish!) and mix everything together - this is your saucy pasta. Add the saucy pasta to an oven-proof dish, then crumble over the remaining goats' cheese. Top with the pine nuts and put the dish in the oven for 10-15 min or until golden and crispy - this is your goats' cheese, spinach & leek pasta bake.",
    "Serve the goats' cheese, spinach & leek pasta bake topped with the reserved chopped basil and a generous grind of black pepper. Enjoy!"
  ]