[
    "Boil a kettle. Peel and finely dice the brown onion. Peel (scrape the skin off with a teaspoon) and finely chop (or grate) the ginger. Peel and finely chop (or grate) the garlic.",
    "Heat a large wide-based pan (preferably non-stick with a matching lid) with a knob of butter over a medium heat. Once hot, add the diced onion, chopped ginger and chopped garlic and cook for 4-5 min or until starting to soften. Once softened, add the ras el hanout and cook for a further 1-2 min or until fragrant.",
    "Meanwhile, dissolve the veg stock mix in 400ml boiled water. Roughly chop the sultanas.",
    "Add the basmati rice, chopped sultanas, veg stock, a pinch of salt and pepper and the juice of 1/2 lime to the pan. Give everything a good mix up and bring to the boil over a high heat. Once boiling, reduce the heat to low and cook, covered, for 12-15 min or until all the liquid has dissolved and the rice is cooked. Tip: Stir the rice occasionally to stop it from sticking!",
    "Whilst the rice is cooking, pat the basa fillets dry with kitchen paper and cut into bite-sized pieces. Add the chopped basa to a large bowl with the cornflour, turmeric and a pinch of salt and pepper and give everything a good mix up until the fish is evenly coated.",
    "Once the rice has had 10 min, heat a separate, large wide-based pan (preferably non-stick) with a drizzle of olive oil over a high heat. Once hot, add the coated basa to the pan and cook for 2-3 min on each side or until crispy and cooked through - this is your crispy fish. Tip: Your fish is cooked when it turns opaque and flakes easily.",
    "While the fish is cooking, wash the spinach, then pat it dry with kitchen paper. Add the spinach to the pan with the rice and cook, covered, for a further 2-3 min or until it's wilted - this is your Lebanese-spiced rice. Cut the remaining lime into wedges.",
    "Serve the Lebanese-spiced rice topped with the crispy fish and drizzle the tahini all over. Garnish with the crispy onions and a lime wedge. Enjoy!"
  ]