[
    "Preheat the oven to 220°C/ 200°C (fan)/ 425°F/ Gas 7. Rinse the brown rice, add it to a pot with plenty of cold water and a pinch of salt and bring to the boil over a high heat. Once boiling, reduce the heat to medium and cook for 20-25 min or until it's tender with a slight bite. Once cooked, drain and return it to the pot and keep covered until serving.",
    "Combine the ground cumin and 2 tbsp olive oil in a bowl and season with a generous pinch of salt and pepper - this is your spice rub. Peel and roughly slice the red onion. Deseed the yellow pepper (scrape the seeds and pith out with a teaspoon) and cut into thick strips. Drain the smoked tofu and pat it dry with kitchen paper, then cut it into thick slices.",
    "Add the sliced tofu and chopped vegetables to a baking tray with the spice rub and give everything a good mix up. Put the tray in the oven for 15-20 min or until the vegetables are tender and the tofu is golden - this is your Mexican tofu and vegetables. Tip: Make sure the tofu is fully coated in all of the spices and season with an extra pinch of salt and pepper.",
    "Meanwhile, boil a kettle. Peel and finely chop (or grate) the garlic. Chop the coriander finely (including the stalks), reserving a few leaves for garnish. Dissolve the Knorr vegetable stock cube in 250ml boiled water.",
    "Drain and rinse the kidney beans. Heat a large, wide-based pan (preferably non-stick) with a drizzle of olive oil over a medium heat. Once hot, add the chopped garlic and drained kidney beans and cook for 1-2 min. Add the vegetable stock and chipotle paste (can't handle the heat? Go easy!) and cook for 4-5 min.",
    "While the kidney beans are cooking, cut the lime in half. Squeeze the juice of 1/2 lime into the beans and mash until smooth - these are your refried beans.",
    "Stir the remaining lime juice and chopped coriander through the drained brown rice and season with a pinch of salt - this is your coriander & lime rice.",
    "Serve the Mexican tofu and vegetables over the coriander & lime rice with the refried beans to the side. Enjoy!"
  ]